terjeio/grblHAL/drivers/MSP430F5529/driver.c
/*
  driver.c - An embedded CNC Controller with rs274/ngc (g-code) support

  Driver code for Texas Instruments MSP430F5529 16-bit processor

  Part of Grbl

  Copyright (c) 2016-2018 Terje Io
  Copyright (c) 2011-2015 Sungeun K. Jeon
  Copyright (c) 2009-2011 Simen Svale Skogsrud

  Grbl is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  Grbl is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with Grbl.  If not, see <http://www.gnu.org/licenses/>.
*/

#include <msp430.h>

#include "GRBL\grbl.h"
#include "driver.h"
#include "eeprom.h"
#include "serial.h"
//#include "usermcodes.h"
//#include "keypad.h"

static volatile bool ms_delay = false;
static volatile uint16_t debounce_count = 0;
static bool pwmEnabled = false, IOInitDone = false, busy = false;
static axes_signals_t step_port_invert, dir_port_invert, next_step_outbits;
static spindle_pwm_t spindle_pwm;
static uint16_t step_pulse_ticks;
static void (*delayCallback)(void) = 0;

static uint_fast16_t spindleSetSpeed (uint_fast16_t pwm_value);

// Inverts the probe pin state depending on user settings and probing cycle mode.
static uint8_t probe_invert;

static void driver_delay_ms (uint32_t ms, void (*callback)(void))
{
    if((ms_delay = ms > 0)) {
        SYSTICK_TIMER_CCR0 = ms;
        SYSTICK_TIMER_CTL |= TACLR|MC0;
        if(!(delayCallback = callback))
            while(ms_delay);
    } else if(callback)
        callback();
}

// Enable/disable stepper motors
static void stepperEnable (axes_signals_t enable)
{
    enable.mask ^= settings.stepper_enable_invert.mask;

    if(enable.x)
        STEPPERS_DISABLE_OUT_XY &= ~STEPPERS_DISABLE_PIN_XY;
    else
        STEPPERS_DISABLE_OUT_XY |= STEPPERS_DISABLE_PIN_XY;

    if(enable.z)
        STEPPERS_DISABLE_OUT_Z &= ~STEPPERS_DISABLE_PIN_Z;
    else
        STEPPERS_DISABLE_OUT_Z |= STEPPERS_DISABLE_PIN_Z;
}

// Starts stepper driver ISR timer and forces a stepper driver interrupt callback
static void stepperWakeUp ()
{
    stepperEnable((axes_signals_t){AXES_BITMASK});

    STEPPER_TIMER_CCR0 = 0xFFFF;        // Set a long initial delay,
    STEPPER_TIMER_CTL |= TACLR|MC0;     // start stepper ISR timer in up mode
    hal.stepper_interrupt_callback();   // and start the show
}

// Disables stepper driver interrupts
static void stepperGoIdle (void)
{
    STEPPER_TIMER_CTL &= ~(MC0|MC1);
}

// Sets up stepper driver interrupt timeout, AMASS version
static void stepperCyclesPerTick (uint32_t cycles_per_tick)
{
    STEPPER_TIMER_CTL |= TACLR; // start in up mode
    STEPPER_TIMER_CCR0 = cycles_per_tick < (1UL << 16) /*< 65536 (4.1ms @ 16MHz)*/ ? cycles_per_tick : 0xFFFF /*Just set the slowest speed possible.*/;
}

// Sets up stepper driver interrupt timeout, "Normal" version
static void stepperCyclesPerTickPrescaled (uint32_t cycles_per_tick)
{
    // Set timer prescaling for normal step generation
    if (cycles_per_tick < (1UL << 16)) { // < 65536  (2.6ms @ 25MHz)
        STEPPER_TIMER_EX0 = TAIDEX_0;  // DIV 1
        STEPPER_TIMER_CTL &= ~(ID0|ID1); // DIV 1
    } else if (cycles_per_tick < (1UL << 19)) { // < 524288 (32.8ms@16MHz)
        STEPPER_TIMER_EX0 = TAIDEX_0; // DIV 1
        STEPPER_TIMER_CTL |= ID0|ID1; // DIV 8
        cycles_per_tick = cycles_per_tick >> 3;
    } else {
        STEPPER_TIMER_EX0 = TAIDEX_7; // DIV 8
        STEPPER_TIMER_CTL &= ID0|ID1; // DIV 8
        cycles_per_tick = cycles_per_tick >> 6;
    }
    STEPPER_TIMER_CCR0 = cycles_per_tick < (1UL << 16) ? cycles_per_tick : 0xFFFF;
    STEPPER_TIMER_CTL |= TACLR|MC0;
}

// Set stepper pulse output pins
// NOTE: step_outbits are: bit0 -> X, bit1 -> Y, bit2 -> Z, needs to be mapped to physical pins by bit shifting or other means
 static void stepperSetStepOutputs (axes_signals_t step_outbits)
{
    STEP_PORT_OUT = (STEP_PORT_OUT & ~HWSTEP_MASK) | (step_outbits.value ^ step_port_invert.value) << 1;
}

// Set stepper direction output pins
// NOTE1: step_outbits are: bit0 -> X, bit1 -> Y, bit2 -> Z, needs to be mapped to physical pins by bit shifting or other means
 static void stepperSetDirOutputs (axes_signals_t dir_outbits)
{
    DIRECTION_PORT_OUT = (DIRECTION_PORT_OUT & ~HWDIRECTION_MASK) | (dir_outbits.value ^ dir_port_invert.value);
}

// Sets stepper direction and pulse pins and starts a step pulse
// When delayed pulse the step register is written in the step delay interrupt handler
static void stepperPulseStart (stepper_t *stepper)
{
    static uint_fast16_t current_pwm = 0;

    if(stepper->spindle_pwm != current_pwm)
        current_pwm = spindleSetSpeed(stepper->spindle_pwm);

    stepperSetDirOutputs(stepper->dir_outbits);
    stepperSetStepOutputs(stepper->step_outbits);

    PULSE_TIMER_CTL |= TACLR|MC0;
}

// Sets stepper direction and pulse pins and starts a step pulse with and initial delay
static void stepperPulseStartDelayed (stepper_t *stepper)
{
    static uint_fast16_t current_pwm = 0;

    if(stepper->spindle_pwm != current_pwm)
        current_pwm = spindleSetSpeed(stepper->spindle_pwm);

    stepperSetDirOutputs(stepper->dir_outbits);
    next_step_outbits = stepper->step_outbits; // Store out_bits
    PULSE_TIMER_CTL |= TACLR|MC0;
}

// Enable/disable limit pins interrupt
static void limitsEnable (bool on)
{
    if (on && settings.flags.hard_limit_enable)
        LIMIT_PORT_IE |= HWLIMIT_MASK; // Enable Pin Change Interrupt
    else
        LIMIT_PORT_IE &= ~HWLIMIT_MASK; // Disable Pin Change Interrupt
}

// Returns limit state as an axes_signals_t variable.
// Each bitfield bit indicates an axis limit, where triggered is 1 and not triggered is 0.
inline static axes_signals_t limitsGetState()
{
    axes_signals_t signals = {0};
    uint8_t flags = LIMIT_PORT_IN;

