terjeio/grblHAL/drivers/MSP430F5529/driver.c
    signals.x = (flags & X_LIMIT_PIN) == X_LIMIT_PIN;
    signals.y = (flags & Y_LIMIT_PIN) == Y_LIMIT_PIN;
    signals.z = (flags & Z_LIMIT_PIN) == Z_LIMIT_PIN;

    if (settings.limit_invert.value)
        signals.value ^= settings.limit_invert.value;

    return signals;
}

// Returns limit state as a control_signals_t variable.
// Each bitfield bit indicates a control signal, where triggered is 1 and not triggered is 0.
inline static control_signals_t systemGetState (void)
{
    uint8_t flags = CONTROL_PORT_IN & HWCONTROL_MASK;
    control_signals_t signals = {0};

    if(flags & RESET_PIN)
        signals.reset = On;
    else if(flags & SAFETY_DOOR_PIN)
        signals.safety_door_ajar = On;
    else if(flags & FEED_HOLD_PIN)
        signals.feed_hold = On;
    else if(flags & CYCLE_START_PIN)
        signals.cycle_start = On;

    if(settings.control_invert.value)
        signals.value ^= settings.control_invert.value;

    return signals;
}

// Sets up the probe pin invert mask to
// appropriately set the pin logic according to setting for normal-high/normal-low operation
// and the probing cycle modes for toward-workpiece/away-from-workpiece.
static void probeConfigureInvertMask(bool is_probe_away)
{
  probe_invert = settings.flags.invert_probe_pin ? 0 : PROBE_PIN;

  if (is_probe_away)
      probe_invert ^= PROBE_PIN;
}

// Returns the probe pin state. Triggered = true.
bool probeGetState (void)
{
    return ((PROBE_PORT_IN & PROBE_PIN) ^ probe_invert) != 0;
}

// Static spindle (off, on cw & on ccw)

inline static void spindleOff (void)
{
    if(settings.spindle_invert.on)
        SPINDLE_ENABLE_OUT |= SPINDLE_ENABLE_PIN;
    else
        SPINDLE_ENABLE_OUT &= ~SPINDLE_ENABLE_PIN;
}

inline static void spindleOn (void)
{
    if(settings.spindle_invert.on)
        SPINDLE_ENABLE_OUT &= ~SPINDLE_ENABLE_PIN;
    else
        SPINDLE_ENABLE_OUT |= SPINDLE_ENABLE_PIN;
}

inline static void spindleDir (bool ccw)
{
    if(hal.driver_cap.spindle_dir) {
        if(ccw ^ settings.spindle_invert.ccw)
            SPINDLE_DIRECTION_OUT |= SPINDLE_DIRECTION_PIN;
        else
            SPINDLE_DIRECTION_OUT &= ~SPINDLE_DIRECTION_PIN;
    }
}

// Starts or stops spindle
static void spindleSetState (spindle_state_t state, float rpm, uint8_t speed_ovr)
{
    if (!state.on)
        spindleOff();
    else {
       spindleDir(state.ccw);
       spindleOn();
    }
}

// Variable spindle control functions

// Spindle speed to PWM conversion. Keep routine small and efficient.
static uint_fast16_t spindleComputePWMValue (float rpm, uint8_t speed_ovr)
{
    uint_fast16_t pwm_value;

    rpm *= (0.010f * speed_ovr); // Scale by spindle speed override value.
    // Calculate PWM register value based on rpm max/min settings and programmed rpm.
    if ((settings.rpm_min >= settings.rpm_max) || (rpm >= settings.rpm_max)) {
        // No PWM range possible. Set simple on/off spindle control pin state.
        sys.spindle_rpm = settings.rpm_max;
        pwm_value = spindle_pwm.max_value - 1;
    } else if (rpm <= settings.rpm_min) {
        if (rpm == 0.0f) { // S0 disables spindle
            sys.spindle_rpm = 0.0f;
            pwm_value = spindle_pwm.off_value;
        } else { // Set minimum PWM output
            sys.spindle_rpm = settings.rpm_min;
            pwm_value = spindle_pwm.min_value;
        }
    } else {
        // Compute intermediate PWM value with linear spindle speed model.
        // NOTE: A nonlinear model could be installed here, if required, but keep it VERY light-weight.
        sys.spindle_rpm = rpm;
        pwm_value = (uint32_t)floorf((rpm - settings.rpm_min) * spindle_pwm.pwm_gradient) + spindle_pwm.min_value;
        if(pwm_value >= spindle_pwm.max_value)
            pwm_value = spindle_pwm.max_value - 1;
    }

    return pwm_value;
}

// Sets spindle speed
static uint_fast16_t spindleSetSpeed (uint_fast16_t pwm_value)
{
    if (pwm_value == hal.spindle_pwm_off) {
        pwmEnabled = false;
        if(settings.flags.spindle_disable_with_zero_speed)
            spindleOff();
        PWM_TIMER_CCTL1 = 0;
    } else {
        if(!pwmEnabled)
            spindleOn();
        pwmEnabled = true;
        PWM_TIMER_CCR1 = pwm_value;
        PWM_TIMER_CCTL1 = OUTMOD_2;
    }

    return pwm_value;
}

// Starts or stops spindle
static void spindleSetStateVariable (spindle_state_t state, float rpm, uint8_t speed_ovr)
{
    if (!state.on || rpm == 0.0f) {
        spindleSetSpeed(hal.spindle_pwm_off);
        spindleOff();
    } else {
        spindleDir(state.ccw);
        spindleSetSpeed(spindleComputePWMValue(rpm, speed_ovr));
    }
}

// Returns spindle state in a spindle_state_t variable
static spindle_state_t spindleGetState (void)
{
    spindle_state_t state = {0};

    state.on = pwmEnabled || (SPINDLE_ENABLE_In & SPINDLE_ENABLE_PIN) != 0;
    state.ccw = hal.driver_cap.spindle_dir && (SPINDLE_DIRECTION_IN & SPINDLE_DIRECTION_PIN) != 0;
    state.value ^= settings.spindle_invert.mask;

    return state;
}

// end spindle code

// Starts/stops coolant (and mist if enabled)
static void coolantSetState (coolant_state_t mode)
{
    mode.value ^= settings.coolant_invert.mask;

    if(mode.flood)
        COOLANT_FLOOD_OUT |= COOLANT_FLOOD_PIN;
    else
        COOLANT_FLOOD_OUT &= ~COOLANT_FLOOD_PIN;

    if(mode.mist)
        COOLANT_MIST_OUT |= COOLANT_MIST_PIN;
    else
        COOLANT_MIST_OUT &= ~COOLANT_MIST_PIN;
}

// Returns coolant state in a coolant_state_t variable
static coolant_state_t coolantGetState (void)
{
    coolant_state_t state = {0};

    state.flood = (COOLANT_FLOOD_IN & COOLANT_FLOOD_PIN) != 0;
    state.mist  = (COOLANT_MIST_IN & COOLANT_MIST_PIN) != 0;

    if(settings.coolant_invert.mask)
        state.value ^= settings.coolant_invert.mask;

    return state;
}

static void showMessage (const char *msg)
{
    hal.serial_write_string("[MSG:");
    hal.serial_write_string(msg);
    hal.serial_write_string("]\r\n");
}

// Helper functions for setting/clearing/inverting individual bits atomically (uninterruptable)
static void bitsSetAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
    _DINT();
    *ptr |= bits;
    _EINT();
}

static uint_fast16_t bitsClearAtomic (volatile uint_fast16_t *ptr, uint_fast16_t bits)
{
    _DINT();
    uint_fast16_t prev = *ptr;
    *ptr &= ~bits;
    _EINT();
    return prev;
}

