terjeio/grblHAL/drivers/MSP430F5529/driver.c
   /********************
    *  Probe pin init  *
    ********************/

    PROBE_PORT_DIR &= ~PROBE_PIN;
    if(hal.driver_cap.probe_pull_up) {
        PROBE_PORT_OUT |= PROBE_PIN;
        PROBE_PORT_REN |= PROBE_PIN;
    }

    /***********************
    *  Coolant pins init  *
    ***********************/

    COOLANT_FLOOD_DIR |= COOLANT_FLOOD_PIN;
    COOLANT_MIST_DIR |= COOLANT_MIST_PIN;

    if(hal.driver_cap.amass_level == 0)
        hal.stepper_cycles_per_tick = &stepperCyclesPerTickPrescaled;

   /******************
    *  Spindle init  *
    ******************/

    SPINDLE_ENABLE_DIR |= SPINDLE_ENABLE_PIN;
    SPINDLE_DIRECTION_DIR |= SPINDLE_DIRECTION_PIN;

    if((hal.driver_cap.variable_spindle)) {
        PWM_PORT_DIR |= PWM_PIN;
        PWM_SEL = PWM_PIN;
        PWM_TIMER_CTL |= TASSEL1|ID0|ID1;
    } else
        hal.spindle_set_state = &spindleSetState;

#ifdef HAS_KEYPAD

   /*********************
    *  I2C KeyPad init  *
    *********************/

    keypad_setup();

#endif

  // Set defaults

    IOInitDone = settings->version == 13;

    settings_changed(settings);

    setSerialReceiveCallback(hal.protocol_process_realtime);
    spindleSetState((spindle_state_t){0}, spindle_pwm.off_value, DEFAULT_SPINDLE_RPM_OVERRIDE);
    coolantSetState((coolant_state_t){0});
    stepperSetDirOutputs((axes_signals_t){0});

    return IOInitDone;

}

// Initialize HAL pointers, setup serial comms and enable EEPROM
// NOTE: Grbl is not yet configured (from EEPROM data), driver_setup() will be called when done
bool driver_init (void)
{
    // Systick timer setup, uses ACLK / 32

    SYSTICK_TIMER_EX0 |= TAIDEX_3;
    SYSTICK_TIMER_CTL |= TACLR|ID0|ID1|TASSEL__ACLK; // for 1mS per count
    SYSTICK_TIMER_CCR0 = 1;
    SYSTICK_TIMER_CCTL0 |= CCIE;

    serialInit();

#ifdef HAS_EEPROM
    eepromInit();
#endif

    hal.info = "MSP430F5529";
    hal.driver_setup = driver_setup;
    hal.f_step_timer = 24000000;
    hal.rx_buffer_size = RX_BUFFER_SIZE;
    hal.delay_ms = driver_delay_ms;
    hal.settings_changed = settings_changed;

    hal.stepper_wake_up = stepperWakeUp;
    hal.stepper_go_idle = stepperGoIdle;
    hal.stepper_enable = stepperEnable;
    hal.stepper_set_outputs = stepperSetStepOutputs;
    hal.stepper_set_directions = stepperSetDirOutputs;
    hal.stepper_cycles_per_tick = stepperCyclesPerTick;
    hal.stepper_pulse_start = stepperPulseStart;

    hal.limits_enable = limitsEnable;
    hal.limits_get_state = limitsGetState;

    hal.coolant_set_state = coolantSetState;
    hal.coolant_get_state = coolantGetState;

    hal.probe_get_state = probeGetState;
    hal.probe_configure_invert_mask = probeConfigureInvertMask;

    hal.spindle_set_state = spindleSetStateVariable;
    hal.spindle_get_state = spindleGetState;
    hal.spindle_set_speed = spindleSetSpeed;
    hal.spindle_compute_pwm_value = spindleComputePWMValue;

    hal.system_control_get_state = systemGetState;

    hal.serial_read = serialGetC;
    hal.serial_write = serialPutC;
    hal.serial_write_string = serialWriteS;
    hal.serial_get_rx_buffer_available = serialRxFree;
    hal.serial_reset_read_buffer = serialRxFlush;
    hal.serial_cancel_read_buffer = serialRxCancel;

    hal.show_message = showMessage;

#ifdef HAS_EEPROM
    hal.eeprom.type = EEPROM_Physical;
    hal.eeprom.get_byte = eepromGetByte;
    hal.eeprom.put_byte = eepromPutByte;
    hal.eeprom.memcpy_to_with_checksum = eepromWriteBlockWithChecksum;
    hal.eeprom.memcpy_from_with_checksum = eepromReadBlockWithChecksum;
#else
    hal.eeprom.type = EEPROM_None;
#endif

    hal.set_bits_atomic = bitsSetAtomic;
    hal.clear_bits_atomic = bitsClearAtomic;
    hal.set_value_atomic = valueSetAtomic;

//    hal.userdefined_mcode_check = userMCodeCheck;
//    hal.userdefined_mcode_validate = userMCodeValidate;
//    hal.userdefined_mcode_execute = userMCodeExecute;

#ifdef HAS_KEYPAD
    hal.execute_realtime = process_keypress;
#endif

  // driver capabilities, used for announcing and negotiating (with Grbl) driver functionality
    hal.driver_cap.spindle_dir = On;
    hal.driver_cap.variable_spindle = On;
    hal.driver_cap.mist_control = On;
    hal.driver_cap.software_debounce = On;
    hal.driver_cap.step_pulse_delay = On;
    hal.driver_cap.amass_level = 3;
    hal.driver_cap.control_pull_up = On;
    hal.driver_cap.limits_pull_up = On;
    hal.driver_cap.probe_pull_up = On;

    __bis_SR_register(GIE);	// Enable interrupts

    // no need to move version check before init - compiler will fail any mismatch for existing entries
    return hal.version == 4;
}

/* interrupt handlers */

// Main stepper driver ISR
#pragma vector=STEPPER_TIMER0_VECTOR
__interrupt void stepper_driver_isr (void)
{
    if(!busy) {
        busy = true;
        _EINT();
        hal.stepper_interrupt_callback();
        busy = false;
    }
}

/* The Stepper Port Reset Interrupt: This interrupt handles the falling edge of the step
   pulse. This should always trigger before the next general stepper driver interrupt and independently
   finish, if stepper driver interrupts is disabled after completing a move.
   NOTE: Interrupt collisions between the serial and stepper interrupts can cause delays by
   a few microseconds, if they execute right before one another. Not a big deal, but can
   cause issues at high step rates if another high frequency asynchronous interrupt is
   added to Grbl.
*/
// This interrupt is enabled when Grbl sets the motor port bits to execute
// a step. This ISR resets the motor port after a short period (settings.pulse_microseconds)
// completing one step cycle.
// NOTE: MSP430 has a shared interrupt for match and timeout

#pragma vector=PULSE_TIMER0_VECTOR
__interrupt void stepper_pulse_isr (void)
{
    stepperSetStepOutputs(step_port_invert);
    PULSE_TIMER_CTL &= ~(MC0|MC1);
}

#pragma vector=PULSE_TIMER1_VECTOR
__interrupt void stepper_pulse_isr_delayed (void)
{
    if(PULSE_TIMER_IV == TA0IV_TACCR1) {
        stepperSetStepOutputs(next_step_outbits);
        PULSE_TIMER_CCR0 = PULSE_TIMER_R + step_pulse_ticks;
    }
}

#pragma vector=WDT_VECTOR
__interrupt void software_debounce_isr (void)
{
    if(!--debounce_count) {
        SFRIE1 &= ~WDTIE;
        axes_signals_t state = limitsGetState();
        if(state.value) //TODO: add check for limit swicthes having same state as when limit_isr were invoked?
            hal.limit_interrupt_callback(state);
    }
}

#pragma vector=CONTROL_PORT_VECTOR
__interrupt void control_isr (void)
{
    uint8_t iflags = CONTROL_PORT_IFG & HWCONTROL_MASK;

    if(iflags) {
        CONTROL_PORT_IFG &= ~iflags;
        hal.control_interrupt_callback(systemGetState());
    }
}

#pragma vector=LIMIT_PORT_VECTOR
__interrupt void limit_isr (void)
{
    uint16_t iflags = LIMIT_PORT_IFG & HWLIMIT_MASK;

    if(iflags) {

        LIMIT_PORT_IFG &= ~iflags;

        if(hal.driver_cap.software_debounce) {
            WDTCTL = WDT_ADLY_16;   // Set watchdog timeout to ~16ms
            SFRIE1 |= WDTIE;        // and enable interrupt
            debounce_count = 3;     // Debounce = 3x watchdog timeout
        } else
            hal.limit_interrupt_callback(limitsGetState());
    }
}

// Interrupt handler for 1 ms interval timer
#pragma vector=SYSTICK_TIMER0_VECTOR
__interrupt void systick_isr (void)
{
    ms_delay = false;
    SYSTICK_TIMER_CTL &= ~(MC0|MC1);
    if(delayCallback) {
        delayCallback();
        delayCallback = 0;
    }
}
